# -*- coding: utf-8 -*-
"""dz_python_1.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/16B0WGU-Gp-auvshsvBn_RSf-MjUTp-pA
"""

# Задание 1
# phrase_1 = 'Насколько проще было бы писать программы, если бы не заказчики'
# phrase_2 = '640Кб должно хватить для любых задач. Билл Гейтс (по легенде)'
# phrase_1 = '640Кб должно хватить для любых задач. Билл Гейтс (по легенде)'
# phrase_2 = 'Насколько проще было бы писать программы, если бы не заказчики'
phrase_1 = 'Насколько проще было бы писать программы, если бы не заказчики'
phrase_2 = 'Насколько проще было бы писать программы, если бы не заказчики'
if len(phrase_1) > len(phrase_2):
    print('Фраза 1 длиннее фразы 2')
elif len(phrase_2) > len(phrase_1):
    print('Фраза 2 длиннее фразы 1')
else:
    print('Фразы равной длины')

# Задание 2
# Високосный  - делится на 4, но не делится на 100.
# или если делится на 400

year = 2000
if (year %4 == 0 and year % 100 != 0) or (year % 400 == 0):
    print('Високосный год')
else:
    print('Обычный год')

# Задание 3
str = 'Ваш знак зодиака: '
# выводить соответствующий знак зодиака
day = int(input('Введите день: '))
mounth = input('Введите месяц: ')

if (mounth == 'Декабрь' and day >= 22) or (mounth == 'Январь' and day <= 20):
#     print('Ваш знак зодиака: Козерог')
    str += 'Козерог'
elif (mounth == 'Январь' and day >= 21) or(mounth == 'Февраль' and day <= 19):
#     print('Ваш знак зодиака: Водолей')
    str += 'Водолей'
elif (mounth == 'Февраль' and day >= 20) or(mounth == 'Март' and day <= 20):
#     print('Ваш знак зодиака: Рыбы')
    str += 'Рыбы'
elif (mounth == 'Март' and day >= 21) or(mounth == 'Апрель' and day <= 20):
#     print('Ваш знак зодиака: Овен')
    str += 'Овен'
elif (mounth == 'Апрель' and day >= 21) or(mounth == 'Май' and day <= 20):
#     print('Ваш знак зодиака: Телец')
    str += 'Телец'
elif (mounth == 'Май' and day >= 21) or(mounth == 'Июнь' and day <= 21):
#     print('Ваш знак зодиака: Близнецы')
    str += 'Близнецы'
elif (mounth == 'Июнь' and day >= 22) or(mounth == 'Июль' and day <= 22):
#     print('Ваш знак зодиака: Рак')
    str += 'Рак'
elif (mounth == 'Июль' and day >= 23) or(mounth == 'Август' and day <= 23):
#     print('Ваш знак зодиака: Лев')
    str += 'Лев'
elif (mounth == 'Август' and day >= 24) or(mounth == 'Сентябрь' and day <= 23):
#     print('Ваш знак зодиака: Дева')
    str += 'Дева'
elif (mounth == 'Сентябрь' and day >= 24) or(mounth == 'Октябрь' and day <= 23):
#     print('Ваш знак зодиака: Весы')
    str += 'Весы'
elif (mounth == 'Октябрь' and day >= 24) or(mounth == 'Ноябрь' and day <= 22):
#     print('Ваш знак зодиака: Скорпион')
    str += 'Скорпион'
elif (mounth == 'Ноябрь' and day >= 23) or(mounth == 'Декабрь' and day <= 21):
#     print('Ваш знак зодиака: Стрелец')
    str += 'Стрелец'
else:
    str = 'error: некоректный ввод'
print(str)

# Задание 4
width = 15
length = 50
height = 15
if (width <= 15 and length <= 15 and height <= 15):
    print('Коробка №1')
elif (width < 50 and length < 50 and height < 50):
    print('Коробка №2')
elif(length > 200):
    print('Ищите упаковку для лыж')
else:
  print('Стандартная коробка №3')

# Задание 5 (необязательное)
number = 123321
# правая половина
sum_right = number % 10
number = number//10
sum_right += number % 10
number = number // 10
sum_right += number % 10
number = number // 10
# левая половина
sum_left = number % 10
number = number //10
sum_left += number % 10
number = number //10
sum_left += number

if sum_right == sum_left:
    print('Счастливый билет')
else:
    print('Несчастливый билет')

# Задание 6 (необязательное)
import math
figure = input('Введите тип фигуры: ')
if figure == 'Круг':
    radius = int(input('Введите радиус круга: '))
    S = math.pi * radius**2
    print('Площадь круга:', S)
elif figure == 'Треугольник':
    s_a = int(input('Введите длину стороны A: '))
    s_b = int(input('Введите длину стороны B: '))
    s_c = int(input('Введите длину стороны C: '))
#     формула Герона, р - полупериметр
    p = (s_a + s_b + s_c)/2    
    S = (p*(p-s_a)*(p-s_b)*(p-s_c))**(1/2)
    print('Площадь треугольника:', S)
elif figure == 'Прямоугольник':
    s_a = int(input('Введите длину стороны A: '))
    s_b = int(input('Введите длину стороны B: '))
    S = s_a*s_b
    print('Площадь прямоугольника:', S)
else:
    print('Неизвестная фигура')
# print(S)